#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ACT-Terraform-Demos/demo-github-actions/runs/run-WnGP544WYZ1sQFKo

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
2023-01-18T05:53:41.122Z [INFO]  Terraform version: 1.3.7
2023-01-18T05:53:41.122Z [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2023-01-18T05:53:41.122Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.15.0
2023-01-18T05:53:41.122Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2023-01-18T05:53:41.122Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2023-01-18T05:53:41.122Z [DEBUG] using github.com/zclconf/go-cty v1.12.1
2023-01-18T05:53:41.122Z [INFO]  Go runtime version: go1.19.4
2023-01-18T05:53:41.122Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:53:41.122Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/.terraformrc
2023-01-18T05:53:41.122Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/.terraformrc
2023-01-18T05:53:41.123Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/.terraform.d/plugins"
2023-01-18T05:53:41.123Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-01-18T05:53:41.123Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/.terraform.d/plugins
2023-01-18T05:53:41.124Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/.local/share/terraform/plugins
2023-01-18T05:53:41.124Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-01-18T05:53:41.124Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-01-18T05:53:41.125Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:53:41.127Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-01-18T05:53:41.791Z [DEBUG] checking for provisioner in "."
2023-01-18T05:53:41.791Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/bin"
2023-01-18T05:53:41.792Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/.terraform.d/plugins"
2023-01-18T05:53:41.856Z [INFO]  backend/local: starting Plan operation
2023-01-18T05:53:42.008Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-01-18T05:53:42.008Z [DEBUG] Building and walking validate graph
2023-01-18T05:53:42.009Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:42.009Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:42.009Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:53:42.009Z [DEBUG] created provider logger: level=debug
2023-01-18T05:53:42.010Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:53:42.027Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:53:42.030Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=62
2023-01-18T05:53:42.030Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:53:42.046Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:53:42.046Z
2023-01-18T05:53:42.076Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin583378878 network=unix timestamp=2023-01-18T05:53:42.076Z
2023-01-18T05:53:42.076Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:53:42.114Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:53:42.114Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=62
2023-01-18T05:53:42.114Z [DEBUG] provider: plugin exited
2023-01-18T05:53:42.115Z [DEBUG] created provider logger: level=debug
2023-01-18T05:53:42.115Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:53:42.122Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:53:42.125Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=76
2023-01-18T05:53:42.125Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:53:42.175Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:53:42.174Z
2023-01-18T05:53:42.201Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin984519946 network=unix timestamp=2023-01-18T05:53:42.201Z
2023-01-18T05:53:42.201Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:53:42.332Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:53:42.332Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=76
2023-01-18T05:53:42.332Z [DEBUG] provider: plugin exited
2023-01-18T05:53:42.332Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg]
2023-01-18T05:53:42.333Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web]
2023-01-18T05:53:42.333Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:53:42.333Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:53:42.333Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:53:42.333Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg]
2023-01-18T05:53:42.333Z [DEBUG] Starting graph walk: walkValidate
2023-01-18T05:53:42.333Z [DEBUG] created provider logger: level=debug
2023-01-18T05:53:42.334Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:53:42.341Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:53:42.344Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=100
2023-01-18T05:53:42.344Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:53:42.393Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:53:42.393Z
2023-01-18T05:53:42.419Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:53:42.419Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin859889212 network=unix timestamp=2023-01-18T05:53:42.419Z
2023-01-18T05:53:42.448Z [DEBUG] created provider logger: level=debug
2023-01-18T05:53:42.448Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:53:42.455Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:53:42.458Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=120
2023-01-18T05:53:42.458Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:53:42.474Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:53:42.474Z
2023-01-18T05:53:42.508Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin779490782 network=unix timestamp=2023-01-18T05:53:42.508Z
2023-01-18T05:53:42.508Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:53:42.548Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:53:42.548Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=120
2023-01-18T05:53:42.548Z [DEBUG] provider: plugin exited
2023-01-18T05:53:42.599Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:53:42.599Z
2023-01-18T05:53:42.600Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:53:42.599Z
2023-01-18T05:53:42.602Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:53:42.603Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=100
2023-01-18T05:53:42.603Z [DEBUG] provider: plugin exited
2023-01-18T05:53:42.603Z [INFO]  backend/local: plan calling Plan
2023-01-18T05:53:42.603Z [DEBUG] Building and walking plan graph for NormalMode
2023-01-18T05:53:42.603Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:42.603Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:53:42.603Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:42.604Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: [random_pet.sg (expand)]
2023-01-18T05:53:42.604Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:53:42.604Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:53:42.604Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand)]
2023-01-18T05:53:42.604Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:53:42.604Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:53:42.604Z [DEBUG] Starting graph walk: walkPlan
2023-01-18T05:53:42.605Z [DEBUG] created provider logger: level=debug
2023-01-18T05:53:42.605Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:53:42.612Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:53:42.615Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=134
2023-01-18T05:53:42.615Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:53:42.665Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:53:42.665Z
2023-01-18T05:53:42.689Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin794413212 network=unix timestamp=2023-01-18T05:53:42.689Z
2023-01-18T05:53:42.689Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:53:42.721Z [DEBUG] created provider logger: level=debug
2023-01-18T05:53:42.722Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:53:42.730Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:53:42.733Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=151
2023-01-18T05:53:42.733Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:53:42.748Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:53:42.748Z
2023-01-18T05:53:42.782Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin227538099 network=unix timestamp=2023-01-18T05:53:42.781Z
2023-01-18T05:53:42.782Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:53:42.819Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
random_pet.sg: Refreshing state... [id=grateful-troll]
2023-01-18T05:53:42.823Z [WARN]  Provider "registry.terraform.io/hashicorp/random" produced an invalid plan for random_pet.sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .length: planned value cty.NumberIntVal(2) for a non-computed attribute
      - .separator: planned value cty.StringVal("-") for a non-computed attribute
2023-01-18T05:53:42.824Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:53:42.825Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=151
2023-01-18T05:53:42.825Z [DEBUG] provider: plugin exited
2023-01-18T05:53:42.872Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/aws\"]" changed the config value, but that value is unused
2023-01-18T05:53:42.873Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [INFO] AWS Auth provider used: "EnvProvider": timestamp=2023-01-18T05:53:42.873Z
2023-01-18T05:53:42.874Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:53:42.874Z
2023-01-18T05:53:42.874Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=2f6adb305eaad33971400cc536daf562b269555d5e4caeef3b714fd7ccd76a09
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T055342Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:53:42.874Z
2023-01-18T05:53:42.926Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:53:42 GMT
X-Amzn-Requestid: 083b0cdb-9393-4bbb-af1e-bc89798f19a5


-----------------------------------------------------: timestamp=2023-01-18T05:53:42.926Z
2023-01-18T05:53:42.926Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>083b0cdb-9393-4bbb-af1e-bc89798f19a5</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:53:42.926Z
2023-01-18T05:53:42.926Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:53:42.926Z
2023-01-18T05:53:42.926Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=2f6adb305eaad33971400cc536daf562b269555d5e4caeef3b714fd7ccd76a09
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T055342Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:53:42.926Z
2023-01-18T05:53:42.947Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:53:42 GMT
X-Amzn-Requestid: 7fa5d3d5-091c-4fc6-8aab-92483c5888de


-----------------------------------------------------: timestamp=2023-01-18T05:53:42.947Z
2023-01-18T05:53:42.947Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>7fa5d3d5-091c-4fc6-8aab-92483c5888de</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:53:42.947Z
2023-01-18T05:53:42.949Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:42 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeAccountAttributes Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-east-1.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 87
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=3481c30e40a5f7a7bed2f061ddfe943c195c55a61c7b3903c12896e3b1305010
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T055342Z
Accept-Encoding: gzip

Action=DescribeAccountAttributes&AttributeName.1=supported-platforms&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:53:42.949Z
2023-01-18T05:53:43.116Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeAccountAttributes Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 540
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:53:43 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: 8891915c-9e2e-4a89-ac97-6882123e2112


-----------------------------------------------------: timestamp=2023-01-18T05:53:43.116Z
2023-01-18T05:53:43.116Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeAccountAttributesResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>8891915c-9e2e-4a89-ac97-6882123e2112</requestId>
    <accountAttributeSet>
        <item>
            <attributeName>supported-platforms</attributeName>
            <attributeValueSet>
                <item>
                    <attributeValue>VPC</attributeValue>
                </item>
            </attributeValueSet>
        </item>
    </accountAttributeSet>
</DescribeAccountAttributesResponse>: timestamp=2023-01-18T05:53:43.116Z
2023-01-18T05:53:43.117Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: []
aws_security_group.web-sg: Refreshing state... [id=sg-0db3602735f398c93]
2023-01-18T05:53:43.120Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeSecurityGroups Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-east-1.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 79
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=1f80b5bd9be32b3ee1c20cb082bbe706d4d4ac9781434eb78434f35acbb7e49f
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T055343Z
Accept-Encoding: gzip

Action=DescribeSecurityGroups&GroupId.1=sg-0db3602735f398c93&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:53:43.120Z
2023-01-18T05:53:43.207Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeSecurityGroups Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 1535
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:53:42 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: c168eb38-6053-42ac-8230-3c3575de27af


-----------------------------------------------------: timestamp=2023-01-18T05:53:43.207Z
2023-01-18T05:53:43.208Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeSecurityGroupsResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>c168eb38-6053-42ac-8230-3c3575de27af</requestId>
    <securityGroupInfo>
        <item>
            <ownerId>309457222015</ownerId>
            <groupId>sg-0db3602735f398c93</groupId>
            <groupName>grateful-troll-sg</groupName>
            <groupDescription>Managed by Terraform</groupDescription>
            <vpcId>vpc-0f940fc7f3bf12d87</vpcId>
            <ipPermissions>
                <item>
                    <ipProtocol>tcp</ipProtocol>
                    <fromPort>8080</fromPort>
                    <toPort>8080</toPort>
                    <groups/>
                    <ipRanges>
                        <item>
                            <cidrIp>0.0.0.0/0</cidrIp>
                        </item>
                    </ipRanges>
                    <ipv6Ranges/>
                    <prefixListIds/>
                </item>
            </ipPermissions>
            <ipPermissionsEgress>
                <item>
                    <ipProtocol>-1</ipProtocol>
                    <groups/>
                    <ipRanges>
                        <item>
                            <cidrIp>0.0.0.0/0</cidrIp>
                        </item>
                    </ipRanges>
                    <ipv6Ranges/>
                    <prefixListIds/>
                </item>
            </ipPermissionsEgress>
        </item>
    </securityGroupInfo>
</DescribeSecurityGroupsResponse>: timestamp=2023-01-18T05:53:43.207Z
2023-01-18T05:53:43.210Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:53:43.210Z
2023-01-18T05:53:43.210Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:53:43.210Z
2023-01-18T05:53:43.212Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.web-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .name_prefix: planned value cty.StringVal("") for a non-computed attribute
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
2023-01-18T05:53:43.213Z [DEBUG] Resource instance state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:53:43.213Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: []
2023-01-18T05:53:43.213Z [DEBUG] refresh: aws_instance.web: no state, so not refreshing
2023-01-18T05:53:43.214Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:53:43 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:53:43.214Z
2023-01-18T05:53:43.217Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_instance.web, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .user_data: planned value cty.StringVal("d36263b945850b1251dc22e4ed5c62aeb9e9e0f0") does not match config value cty.StringVal("#!/bin/bash\napt-get update\napt-get install -y apache2\nsed -i -e 's/80/8080/' /etc/apache2/ports.conf\necho \"Hello World\" > /var/www/html/index.html\nsystemctl restart apache2\n")
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-01-18T05:53:43.218Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:53:43.218Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=134
2023-01-18T05:53:43.219Z [DEBUG] provider: plugin exited
2023-01-18T05:53:43.219Z [DEBUG] building apply graph to check for errors
2023-01-18T05:53:43.219Z [DEBUG] Resource state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:53:43.219Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:43.219Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:53:43.219Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:43.219Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:53:43.219Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: []
2023-01-18T05:53:43.219Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: []
2023-01-18T05:53:43.219Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:53:43.220Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand) aws_instance.web aws_instance.web]
2023-01-18T05:53:43.220Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:53:43.220Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:53:43.220Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:53:43.220Z [DEBUG] pruneUnusedNodes: random_pet.sg (expand) is no longer needed, removing
2023-01-18T05:53:43.220Z [DEBUG] pruneUnusedNodes: provider["registry.terraform.io/hashicorp/random"] is no longer needed, removing
2023-01-18T05:53:43.220Z [INFO]  backend/local: plan operation completed
2023-01-18T05:53:43.220Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-WnGP544WYZ1sQFKo/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0b5eea76982371e91"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = [
          + "sg-0db3602735f398c93",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pushed by: @dassiorleando, Action: `pull_request`*